xiangjianhe/MonitorPro/code/Project/Header/Foxconn/FOX_LI2241W_CMI_M215HGE_L21.h
#define _CONTRAST_CHANG_POINT_DIGITAL					100
#define _CONTRAST_MAX_DIGITAL							112
#define _CONTRAST_MIN_DIGITAL							40

//NovoVision mode Backlight Base Def for FOXCONN _LENOVO_ORG_OSD
#define _WEB_BRI_BASE_DEF								85
#define _VIDEO_BRI_BASE_DEF								95
#define _SPLIT_BRI_BASE_DEF								85

//----------------------------------------------------
// Brightness PWM Table
//----------------------------------------------------
#define _PWM_B00                                        89//|00
#define _PWM_B10                                        90//|10
#define _PWM_B20                                        93//|20
#define _PWM_B30                                        99//|30
#define _PWM_B40                                        109//|40
#define _PWM_B50                                        122//|50
#define _PWM_B60                                        141//|60
#define _PWM_B70                                        163//|70
#define _PWM_B80                                        202//|80
#define _PWM_B90                                        224//|90
#define _PWM_B100                                       255//|100

#define MIN_BACKLIGHT_PWM                               _PWM_B00
//-----------------------------------------------------------------------------------------------------------
#if((_PWM_B50>_PWM_B60)||(_PWM_B60>_PWM_B70)||(_PWM_B70>_PWM_B80)||(_PWM_B80>_PWM_B90)||(_PWM_B90>_PWM_B100))
  #error: PWM data error!!!
#endif

//==================================================================
// COLOR TEMP DEFAULT DATA
// Definitions Colortemp RGB value for each project
//==================================================================
#define _CT7200_LenovoPrj_RED                                   112
#define _CT7200_LenovoPrj_GREEN                                 116
#define _CT7200_LenovoPrj_BLUE                                  128

#define _CTSRGB_LenovoPrj_RED                                   126
#define _CTSRGB_LenovoPrj_GREEN                                 126
#define _CTSRGB_LenovoPrj_BLUE                                  128

#define _CT6500_LenovoPrj_RED                                   126
#define _CT6500_LenovoPrj_GREEN                                 126
#define _CT6500_LenovoPrj_BLUE                                  128

#define _CT9300_LenovoPrj_RED                                   100
#define _CT9300_LenovoPrj_GREEN                                 104
#define _CT9300_LenovoPrj_BLUE                                  128

#define _CTUSER_LenovoPrj_RED                                   128
#define _CTUSER_LenovoPrj_GREEN                                 128
#define _CTUSER_LenovoPrj_BLUE                                  128

#define _CTVIDEO_LenovoPrj_RED									_CT9300_LenovoPrj_RED
#define _CTVIDEO_LenovoPrj_GREEN								_CT9300_LenovoPrj_GREEN
#define _CTVIDEO_LenovoPrj_BLUE									_CT9300_LenovoPrj_BLUE

#define _CTLOWBLUELIGHT_RED                                     128
#define _CTLOWBLUELIGHT_GREEN                                   109
#define _CTLOWBLUELIGHT_BLUE                                    84

//-------------------------------------------------
//define Audio
//-------------------------------------------------
#define _AUDIO_ADJUST_FUNCTION_SUPPORT				            _OFF
#define _AUDIO_EXTERNAL_AMP_SUPPORT								_OFF
#define _ANALOG_VOLUME_MUTE										0x0000

//==================================================================
// Fine tuning OSD H position by pixel
//==================================================================
#if(_LOW_BLUE_LIGHT_FUNCTION == _ON)
#define _OSD_POSITION_FONT_A_H_DELAY_                           2
#else
#define _OSD_POSITION_FONT_A_H_DELAY_                           0
#endif

//20130312 Abel DCR Modify
//--------------------------------------------------
// Definitions for DCR Panel ON/OFF Timer
//--------------------------------------------------
#if(_USER_DCR_FUNCTION == _ON)
#undef _DCR_SUPPORT
#define _DCR_SUPPORT											_ON

#define _BACKLIGHT_OFF_TIMER                                    1500 // _BACKLIGHT_OFF_TIMER * _INSTANT_TIMER_EVENT_1 (ms)
#define _DCR_PANEL_ON_OFF							            _ON    
#else
#define _DCR_PANEL_ON_OFF							            _OFF 
#endif

//-------------------------------------------------
// Instant Timer Events Options
// Add ?PR?USERINTERFACETIMER0INSTANTACCESS_TIMER0?RTD2011USERINTERFACE
//     ?PR?USERINTERFACETIMER1INSTANTACCESS_TIMER1?RTD2011USERINTERFACE
// To Link File Bank 0 In Order to Increase Efficiency
//-------------------------------------------------
#define _INSTANT_TIMER_EVENT_0                                  _OFF
#if ((_USER_DCR_FUNCTION == _ON) && (_DCR_PANEL_ON_OFF == _ON))
#define _INSTANT_TIMER_EVENT_1                                  _ON
#else
#define _INSTANT_TIMER_EVENT_1                                  _OFF
#endif

#endif // End of #if(_PROJECT == _FOX_LI2241W_CMI_M215HGE_L21)

